spotify-playlister-api/app/models/user.rb

    scope :find_by_ci_username, -> (username) { where('lower("username") = ?', username.downcase).first }
---
SELECT "users".* FROM "users" WHERE (lower("username") = 'user3') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]