spotify-playlister-api/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def current_user
        # @current_user ||= User.find(session[:user_id]) if session[:user_id]
        current_user ||= User.find_by(id: session[:user_id])

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ? AND "playlists"."id" = ? LIMIT ?  [["user_id", 8], ["id", 119], ["LIMIT", 1]]
---
    def current_playlist(playlist_id)
        current_user.playlists.find_by(id: playlist_id)