spotify-playlister-api/app/controllers/playlists_controller.rb

INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["user_id", 4], ["created_at", "2021-03-03 06:32:05.201089"], ["updated_at", "2021-03-03 06:32:05.201089"]]
---
    def create
        playlist = Playlist.new(playlist_params)

        if playlist.save

DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 37]]
---
    def destroy
        current_playlist.destroy

SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ? AND "playlists"."id" = ? LIMIT ?  [["user_id", 4], ["id", 37], ["LIMIT", 1]]
---
    def current_playlist
        current_user.playlists.find_by(id: params[:id])