spotify-playlister-api/app/controllers/sessions_controller.rb

    def is_logged_in?

        if logged_in?

          songs = current_user.songs.map do | song |
            playlistIds = song.playlists.map { |p| p.id }
---
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" INNER JOIN "playlists" ON "playlist_songs"."playlist_id" = "playlists"."id" WHERE "playlists"."user_id" = ?  [["user_id", 4]]
SELECT "playlists".* FROM "playlists" INNER JOIN "playlist_songs" ON "playlists"."id" = "playlist_songs"."playlist_id" WHERE "playlist_songs"."song_id" = ?  [["song_id", 4]]