spotify-playlister-api/app/controllers/songs_controller.rb

    def create
        playlist = current_playlist(params[:playlist_id])
        song = playlist.songs.create_with(song_params).find_or_create_by(spotify_id: song_params[:spotify_id])
        if song.errors.full_messages.blank?
            song_hash = song.attributes
            song_hash[:playlistIds] = song.playlists.map{ | playlist | playlist.id }
---
INSERT INTO "playlist_songs" ("playlist_id", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["playlist_id", 119], ["song_id", 61], ["created_at", "2021-03-06 14:48:31.955699"], ["updated_at", "2021-03-06 14:48:31.955699"]]
INSERT INTO "songs" ("title", "artists", "album_name", "url", "spotify_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ? AND "songs"."spotify_id" = ? LIMIT ?  [["playlist_id", 111], ["spotify_id", "2Fs18NaCDuluPG1DHGw1XG"], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ? AND "songs"."spotify_id" = ? LIMIT ?  [["playlist_id", 80], ["spotify_id", "1tkg4EHVoqnhR6iFEXb60y"], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" INNER JOIN "playlist_songs" ON "playlists"."id" = "playlist_songs"."playlist_id" WHERE "playlist_songs"."song_id" = ?  [["song_id", 61]]

    def destroy
        binding.pry
        current_song.playlist_songs.find_by(playlist_id: params[:playlist_id]).destroy
---
SELECT "playlists".* FROM "playlists" INNER JOIN "playlist_songs" ON "playlists"."id" = "playlist_songs"."playlist_id" WHERE "playlist_songs"."song_id" = ?  [["song_id", 60]]
DELETE FROM "playlist_songs" WHERE "playlist_songs"."id" = ?  [["id", 62]]
SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."song_id" = ? AND "playlist_songs"."playlist_id" = ? LIMIT ?  [["song_id", 61], ["playlist_id", 119], ["LIMIT", 1]]

    def current_song
        current_playlist(params[:playlist_id]).songs.find_by(id: params[:id])
---
SELECT "songs".* FROM "songs" INNER JOIN "playlist_songs" ON "songs"."id" = "playlist_songs"."song_id" WHERE "playlist_songs"."playlist_id" = ? AND "songs"."id" = ? LIMIT ?  [["playlist_id", 119], ["id", 61], ["LIMIT", 1]]